// Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.
//b1 = 2, k1 = 5, b2 = 4, k2 = 9-> (-0, 5; -0,5)

// k1*x - y + b1 = 0
// k2*x - y + b2 = 0
// x * (k1 - k2) + b1 - b2 = 0
// x = (-b1 + b2) / (k1 - k2)
// y = k1 * x + b1

var array = new double[,] { { 2, 5 }, { 4, 9 } };

var x = (-array[0, 0] + array[1, 0]) / (array[0, 1] - array[1, 1]);
var y = array[0, 1] * x + array[0, 0];

Console.WriteLine($"({x};{y})");